In [26]:
import pandas as pd
import numpy as np

data = {
    "Name": ["Pinky", "Rinky", np.nan, "Latha", "Ruhi"],
    "Age": [25, np.nan, 30, 35, np.nan],
    "Salary": [50000, 60000, np.nan, 70000, 80000],
    "Department": ["HR", "IT", "Finance", np.nan, "IT"]
}

df = pd.DataFrame(data)
print(df)

    Name   Age   Salary Department
0  Pinky  25.0  50000.0         HR
1  Rinky   NaN  60000.0         IT
2    NaN  30.0      NaN    Finance
3  Latha  35.0  70000.0        NaN
4   Ruhi   NaN  80000.0         IT

In [27]:
d1 = df.copy()
print(d1)

    Name   Age   Salary Department
0  Pinky  25.0  50000.0         HR
1  Rinky   NaN  60000.0         IT
2    NaN  30.0      NaN    Finance
3  Latha  35.0  70000.0        NaN
4   Ruhi   NaN  80000.0         IT

In [28]:
from sklearn.impute import SimpleImputer

In [29]:
num_imputers = SimpleImputer(strategy = 'mean')
num_cols = d1.select_dtypes( include = [np.number]).columns
d1[num_cols] = num_imputers.fit_transform(d1[num_cols])
d1.head()

    Name   Age   Salary Department
0  Pinky  25.0  50000.0         HR
1  Rinky  30.0  60000.0         IT
2    NaN  30.0  65000.0    Finance
3  Latha  35.0  70000.0        NaN
4   Ruhi  30.0  80000.0         IT

In [30]:
num_cat = SimpleImputer(strategy = 'most_frequent')
cat_cols= d1.select_dtypes( include = ['object']).columns
d1[cat_cols] = num_cat.fit_transform(d1[cat_cols])
d1.head()

    Name   Age   Salary Department
0  Pinky  25.0  50000.0         HR
1  Rinky  30.0  60000.0         IT
2  Latha  30.0  65000.0    Finance
3  Latha  35.0  70000.0         IT
4   Ruhi  30.0  80000.0         IT

In [32]:
from sklearn.impute import KNNImputer

In [40]:
data = pd.DataFrame({
    'Feature1': [1, 2, np.nan, 4, 5, 6, 7, np.nan, 9, 10],
 'Feature2': [10, 20, 30, np.nan, 50, 60, np.nan, 80, 90, 100],
 'Feature3': [100, np.nan, 300, 400, 500, np.nan, 700, 800, 900,
1000]
})
knn = KNNImputer(n_neighbors= 3 ,weights = 'uniform')
d = pd.DataFrame(
    knn.fit_transform(data),
    columns = data.columns
)
d.head()

   Feature1   Feature2  Feature3
0       1.0  10.000000     100.0
1       2.0  20.000000     400.0
2       4.0  30.000000     300.0
3       4.0  43.333333     400.0
4       5.0  50.000000     500.0